InformationRegisters/ФактОплатыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ФактОплатыЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНастроекИнтеграцииРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииРМК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Интеграция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиИнтеграцииСПлатежнымиСистемамиРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПлатежнаяСистемаККТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипПлатежнойСистемыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПлатежнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СпособОплатыПлатежныхСистемРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиПодсказок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиПодсказок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПодсказки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодсказок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыЗаполненияДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыЗаполненияДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибавлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДнейРасчетаДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыДнейРасчетаДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыВыводаСуммыБезСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыВыводаСуммыБезСкидки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Печатать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПечатать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодыНоменклатурыВДокументах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>КодыНоменклатурыВДокументах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрихкод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПустоеЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтроляДоговоровПриПроведении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтроляДоговоровПриПроведении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПодсказок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПодсказок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизацииДляПечати</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкиЗагрузкиЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/БизнесПриложениеВыставлениеСчетов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВозможностиПодключаемогоПриложения = ФункциональныеВозможностиПриложения();
	
	Отбор = Новый Структура("ЗначениеПоУмолчанию", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(Истина);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Константы.ИспользоватьРаботуСПоискомКонтрагентовВСписке.Установить(Ложь);
	
	// Устанавливаем настройки ЕБВ, которые необходимы для комфортной работы с приложением
	УстановитьЗначенияНастроекПриложения();
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ОтключаемыеВозможности = ФункциональныеВозможностиПриложения();
	
	Для Каждого ОтключаемаяВозможность Из ОтключаемыеВозможности Цикл
		
		Если ИсключаяВозможностиПриложений.Найти(ОтключаемаяВозможность.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ИмяКонстанты = ОтключаемаяВозможность.Имя;
			Константы[ИмяКонстанты].Установить(Ложь);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
	
		КонецПопытки;
		
	КонецЦикла;
	
	// специфичная функциональность
	
КонецПроцедуры

// Процедура настраивает форму заказа покупателя для приложения "Выставление счетов"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма документа "Заказ покупателя"
//
Процедура ПриСозданииНаСервереЗаказПокупателя(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИнтерфейсВыставленияСчетов = ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов");
	
	// Специфические действия с элементами формы
	Если ИнтерфейсВыставленияСчетов Тогда
		
		// Прячем контекстные отчеты
		ПараметрыФОСвязанныхОтчетов = Новый Структура;
		ПараметрыФОСвязанныхОтчетов.Вставить("СвязанныеОтчеты", Неопределено);
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФОСвязанныхОтчетов);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		
		Для каждого Элемент Из Элементы.Запасы.ПодчиненныеЭлементы Цикл
			Элемент.ЦветФонаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
			Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
				Для каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
					ЭлементГруппы.ЦветФонаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		// Временный обход ошибки платформы для веб клиента
		Элементы.ЗапасыРучнаяСкидка.ЦветФонаЗаголовка = Новый Цвет();
		
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			Форма.АвтоЗаголовок = Ложь;
			Форма.Заголовок = НСтр("ru = 'Счет (создание)'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСодержимоеЗаказа", "ВертикальнаяПрокруткаПриСжатии", Истина);
		Форма.ВертикальнаяПрокрутка = ВертикальнаяПрокруткаФормы.ИспользоватьПриНеобходимости;
		
		ВосстановитьНастройкиФормыЗаказа(Форма);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Видимость", НЕ Форма.ПраваяПанельСвернута);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Видимость", Форма.ПраваяПанельСвернута);
	
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанель", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПраваяПанельСвернуто", "Видимость", Ложь);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Шапка", "Видимость", НЕ ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подвал", "Видимость", НЕ ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ШапкаВыставлениеСчетов", "Видимость", ИнтерфейсВыставленияСчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодвалВыставлениеСчетов", "Видимость", ИнтерфейсВыставленияСчетов);
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		// Шапка
		Элементы.ГруппаЗаголовокСчета.Ширина = 0;
		Элементы.НомерВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
		Элементы.НомерВыставлениеСчетов.РастягиватьПоГоризонтали = Ложь;
		
		Элементы.ДатаВыставлениеСчетов.ШрифтЗаголовка = Новый Шрифт;
		Элементы.ДатаВыставлениеСчетов.РастягиватьПоГоризонтали = Ложь;
		
		Элементы.ГруппаЛогоРеквизитыКод.Заголовок = НСтр("ru = 'Логотип, QR-код'");
		Элементы.Переместить(Элементы.РеквизитыШапкиВыставлениеСчетов, Элементы.ШапкаВыставлениеСчетов, Элементы.ГруппаЗаголовокСчета);
		
		Элементы.ДекорацияQRСБП.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		Элементы.ДекорацияQR.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
		// Подвал
		Элементы.ПодвалВыставлениеСчетов.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
		Элементы.ПодвалВыставлениеСчетов.Заголовок = НСтр("ru = 'Подписи и условия'");
		Элементы.Переместить(Элементы.ГруппаИтогиВыставлениеСчетов, Элементы.СтраницаЗапасы);
		Элементы.ИтогиВыставлениеСчетов.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
		Элементы.СкидкиВыставлениеСчетов.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
		Элементы.ГруппаВсегоСуммаПрописью.Видимость = Ложь;
	
		// Правая панель
		Элементы.ГруппаЗаказИПраваяПанель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ПраваяПанель.Заголовок = НСтр("ru = 'Действия с документом'");
		Элементы.ПраваяПанель.Ширина = 0;
		Элементы.ГруппаОтступ.Видимость = Ложь;
		
		// Прочее
		Элементы.ДекорацияРазделитель1.Видимость = Ложь;
		Элементы.ДекорацияРазделитель2.Видимость = Ложь;
		Элементы.ДекорацияРазделитель3.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура настраивает форму списка заказов покупателей для приложения "Выставление счетов"
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма списка заказов покупателей
//
Процедура ПриСозданииНаСервереСписокЗаказПокупателя(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Форма.ИнтерфейсВыставлениеСчетов = ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов");
	Элементы.ГруппаАналитикаВыставлениеСчетов.Видимость = Форма.ИнтерфейсВыставлениеСчетов;
	Если Форма.ИнтерфейсВыставлениеСчетов Тогда
		Форма.Заголовок = НСтр("ru = 'Выставление счетов'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтгрузки", "Видимость", Ложь);
		ОбновитьАналитикуВСпискеЗаказов(Форма);
		Элементы.ЗагрузитьСтатусыОплатыВыставлениеСчетов.Видимость = ИнтеграцияСПлатежнымиСистемамиУНФ.ИнтеграцияДоступна();
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает цвет состояния заказа в декорациях
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма документа "Заказ покупателя"
//
Процедура УстановитьЦветСостоянияЗаказа(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов") Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Форма.Объект.СостояниеЗаказа) Тогда
		ХранилищеЦвета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.СостояниеЗаказа, "Цвет");
		Цвет = ХранилищеЦвета.Получить();
		Если Цвет = Неопределено Тогда
			Цвет = ЦветаСтиля.ЦветТекстаПоля;
		КонецЕсли;
	Иначе
		Цвет = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	КонецЕсли;
	
	ИмяВременногоФайлаSVG = ПолучитьИмяВременногоФайла();
	ФайлКартинки = Новый ЗаписьТекста(ИмяВременногоФайлаSVG);
	ФайлКартинки.Записать(СтрШаблон(ШаблонИндикатораСостояния(), ЦветВHex(Цвет.ПолучитьАбсолютный())));
	ФайлКартинки.Закрыть();
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаSVG);
	УдалитьФайлы(ИмяВременногоФайлаSVG);
	
	Форма.ИндикаторСостояния = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура дополняет движения документа "Заказ покупателя" необходимыми данными для приложения "Выставление счетов"
//
// Параметры:
//  ДокументСсылкаЗаказПокупателя	 - ДокументСсылка.ЗаказПокупателя - Заказ, который проводится
//  СтруктураДополнительныеСвойства	 - Структура - Параметры проведения
//
Процедура ПриПроведенииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, СтруктураДополнительныеСвойства) Экспорт
	
	ОплаченВВыставленииСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаЗаказПокупателя, "ОплаченВВыставленииСчетов");
	ОтгруженВВыставленииСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаЗаказПокупателя, "ОтгруженВВыставленииСчетов");
	
	Если ОплаченВВыставленииСчетов Тогда
		
		ИсходнаяТаблица = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОплатаСчетовИЗаказов.Скопировать();
		
		Для каждого ИсходнаяСтрока Из ИсходнаяТаблица Цикл
		
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОплатаСчетовИЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
			НоваяСтрока.СуммаАванса = НоваяСтрока.Сумма;
			НоваяСтрока.Сумма = 0;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтгруженВВыставленииСчетов Тогда
		
		ИсходнаяТаблица = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей.Скопировать();
		
		Для каждого ИсходнаяСтрока Из ИсходнаяТаблица Цикл
		
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
			НоваяСтрока.ВидДвижения = ?(ИсходнаяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет аналитику в списке заказов покупателей
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма списка заказов покупателей
//
Процедура ОбновитьАналитикуВСпискеЗаказов(Форма) Экспорт
	
	ДанныеАналитики = Новый Структура;
	ДанныеАналитики.Вставить("ВсегоЗаказов", 0);
	ДанныеАналитики.Вставить("ОплаченоЗаказов", 0);
	ДанныеАналитики.Вставить("СуммаВсего", 0);
	ДанныеАналитики.Вставить("СуммаОплачено", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.Ссылка), 0) КАК ВсегоЗаказов,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА ЗаказПокупателя.СуммаДокумента <= ЕСТЬNULL(ФактОплатыЗаказов.СуммаАванса, 0) + ЕСТЬNULL(ФактОплатыЗаказов.СуммаОплаты, 0)
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ОплаченоЗаказов,
		|	ЕСТЬNULL(СУММА(ЗаказПокупателя.СуммаДокумента), 0) КАК СуммаВсего,
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ФактОплатыЗаказов.СуммаАванса, 0) + ЕСТЬNULL(ФактОплатыЗаказов.СуммаОплаты, 0)), 0) КАК СуммаОплачено
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФактОплатыЗаказов КАК ФактОплатыЗаказов
		|		ПО (ФактОплатыЗаказов.СчетНаОплату = ЗаказПокупателя.Ссылка)
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И &Отборы";
	
	СтрокаОтборов = "";
	
	Если ЗначениеЗаполнено(Форма.ОтборПериод.ДатаНачала) 
		ИЛИ ЗначениеЗаполнено(Форма.ОтборПериод.ДатаОкончания) Тогда
		
		Если НЕ ЗначениеЗаполнено(Форма.ОтборПериод.ДатаОкончания) Тогда
			СтрокаОтборов = " И ЗаказПокупателя.Дата >= &ДатаНачала";
		Иначе
			СтрокаОтборов = " И ЗаказПокупателя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала", Форма.ОтборПериод.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Форма.ОтборПериод.ДатаОкончания);
		
	КонецЕсли;
	
	ШаблонОтбора = " И ЗаказПокупателя.ИмяПоляОтбора В (&ИмяПоляОтбора)";
	
	СписокОтборы = Новый Массив;
	СписокОтборы.Добавить("Организация");
	СписокОтборы.Добавить("Контрагент");
	СписокОтборы.Добавить("СостояниеЗаказа");
	СписокОтборы.Добавить("ВариантЗавершения");
	
	Для каждого СтрокаОтбора Из Форма.ДанныеМеток Цикл
		
		Если СписокОтборы.Найти(СтрокаОтбора.ИмяПоляОтбора) <> Неопределено Тогда
			СписокОтборы.Удалить(СписокОтборы.Найти(СтрокаОтбора.ИмяПоляОтбора));
			СтрокаОтборов = СтрокаОтборов + СтрЗаменить(ШаблонОтбора, "ИмяПоляОтбора", СтрокаОтбора.ИмяПоляОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаОтбора Из Форма.ДанныеМеток Цикл
		
		Если НЕ Запрос.Параметры.Свойство(СтрокаОтбора.ИмяПоляОтбора) Тогда
			 Запрос.УстановитьПараметр(СтрокаОтбора.ИмяПоляОтбора, Новый Массив);
		КонецЕсли;
		
		Запрос.Параметры[СтрокаОтбора.ИмяПоляОтбора].Добавить(СтрокаОтбора.Метка);
		
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Отборы", СтрокаОтборов);
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИтоги.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеАналитики, ВыборкаИтоги);
	КонецЕсли;
	
	МаксимальнаяДлинаИндикатора = 270;
	ШаблонСумма = НСтр("ru='%1 ₽'");
	ШаблонКоличество = НСтр("ru='%1 шт.'");
	
	Форма.Элементы.ДекорацияСуммаВсего.Заголовок = СтрШаблон(ШаблонСумма, ДанныеАналитики.СуммаВсего);
	Форма.Элементы.ДекорацияСуммаОплачено.Заголовок = СтрШаблон(ШаблонСумма, ДанныеАналитики.СуммаОплачено);
	Форма.Элементы.ДекорацияКоличествоВсего.Заголовок = СтрШаблон(ШаблонКоличество, ДанныеАналитики.ВсегоЗаказов);
	Форма.Элементы.ДекорацияКоличествоОплачено.Заголовок = СтрШаблон(ШаблонКоличество, ДанныеАналитики.ОплаченоЗаказов);
	
	Если ДанныеАналитики.СуммаВсего = 0 ИЛИ ДанныеАналитики.СуммаОплачено = 0 Тогда
		ДлинаИндикатораОплаты = 0;
	Иначе
		Доля = ДанныеАналитики.СуммаОплачено / ДанныеАналитики.СуммаВсего;
		ДлинаИндикатораОплаты = Цел(МаксимальнаяДлинаИндикатора * Доля);
		Если ДлинаИндикатораОплаты > МаксимальнаяДлинаИндикатора Тогда
			ДлинаИндикатораОплаты = МаксимальнаяДлинаИндикатора;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонСостояниеОплатыЗаказов = ШаблонСостояниеОплатыЗаказов();
	ИмяВременногоФайлаSVG = ПолучитьИмяВременногоФайла();
	ФайлКартинки = Новый ЗаписьТекста(ИмяВременногоФайлаSVG);
	ФайлКартинки.Записать(СтрШаблон(ШаблонСостояниеОплатыЗаказов, ДлинаИндикатораОплаты));
	ФайлКартинки.Закрыть();
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайлаSVG);
	УдалитьФайлы(ИмяВременногоФайлаSVG);
	
	Форма.СостояниеОплатыЗаказов = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура настраивает отображения декорации QR-кода
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - Форма документа заказ покупателя
//
Процедура НастроитьДекорациюQR(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИнтерфейсВыставлениеСчетов") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Контрагент, "ВидКонтрагента");
	ЭтоЮрЛицо = ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган
					ИЛИ ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
					ИЛИ ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
					
	Если ЭтоЮрЛицо Тогда
		
		Элементы.ДекорацияQR.Видимость = Ложь;
		Элементы.ДекорацияQRСБП.Видимость = Ложь;
		
	Иначе
		
		Если ПереводыСБПc2b.ПереводыСБПДоступны() Тогда
			НастройкиПлатежныхСистем = РегистрыСведений.СоответствиеНастроекИнтеграцииРМК.НастройкиИнтеграции(Форма.Объект.Организация, Форма.Объект.СтруктурнаяЕдиницаПродажи);
			НастроенСБП = НастройкиПлатежныхСистем <> Неопределено;
		Иначе
			НастроенСБП = Ложь;
		КонецЕсли;
		
		Если НастроенСБП Тогда
			Элементы.ДекорацияQR.Видимость = Ложь;
			Элементы.ДекорацияQRСБП.Видимость = Истина;
		Иначе
			Элементы.ДекорацияQR.Видимость = Истина;
			Элементы.ДекорацияQRСБП.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет переданные настройки формы при их имзменении
//
// Параметры:
//  СтруктураНастроек - Структура - Настройки для сохранения.
//
Процедура СохранитьНастройкиФормы(СтруктураНастроек) Экспорт
	
	ИмяКлючаОбъекта = ПолучитьКлючОбъектаЗаказ();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяКлючаОбъекта, ИмяКлючаОбъекта + СтруктураНастроек.Имя, СтруктураНастроек.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШаблонИндикатораСостояния()
	
	Возврат "<svg width=""16px"" height=""16px"" viewBox=""0 0 16 16"" version=""1.1"" xmlns=""http://www.w3.org/2000/svg"" xmlns:xlink=""http://www.w3.org/1999/xlink"">
			|<circle r=""8"" cx=""8"" cy=""8"" fill=""#%1""/>
			|</svg>";
	
КонецФункции

Функция ШаблонСостояниеОплатыЗаказов()
	
	Возврат "<svg width=""270px"" height=""30px"" viewBox=""0 -10 271 30"" version=""1.1"" xmlns=""http://www.w3.org/2000/svg"" xmlns:xlink=""http://www.w3.org/1999/xlink"">
			|<rect x=""1"" y=""1"" rx=""2"" ry=""2"" width=""270"" height=""8"" fill=""#D0D0D0""/>
			|<rect x=""1"" y=""1"" rx=""2"" ry=""2"" width=""%1"" height=""8"" fill=""#00AA00""/>
			|</svg>";
	
КонецФункции

Функция ЦветВHex(Знач Цвет)
	
	Возврат ДополнитьСтроку(Из_10_В_Любую(Цвет.Красный), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Зеленый), 2)
			+ ДополнитьСтроку(Из_10_В_Любую(Цвет.Синий), 2);
КонецФункции

Функция Из_10_В_Любую(Знач Значение = 0, Знач Нотация = 16)
	
	Если Нотация <= 0 Тогда 
		Возврат "";
	КонецЕсли;
	Значение = Число(Значение);
	Если Значение <= 0 Тогда 
		Возврат "0";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	Строка = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"; 
	Пока Значение > 0 Цикл
		Результат = Сред(Строка, Значение % Нотация + 1, 1) + Результат;
		Значение = Цел(Значение / Нотация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьСтроку(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева")
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Индекс = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИнтерфейсВыставлениеСчетов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюРаботуСПодписями", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "УпрощеннаяРаботаСоСтавкамиНДС", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюФормуКонтрагентов", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьУпрощеннуюФормуНоменклатуры", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьПростуюКоманднуюПанельВЗаказеПокупателя", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьПростуюКоманднуюПанельВОрганизациях", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ОтображатьПереходКСпискуНоменклатурыВГлавном", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ОтображатьПереходКСпискуПокупателей", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ФункциональнаяОпцияУчетЦенПродажи", Истина);
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Процедура УстановитьЗначенияНастроекПриложения()
	
	// Настройки необходимо выполнить только в том случае, если счета еще не выставлялись
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Дата отгрузки по умолчанию будет равна дате документа
	НаборКонстант = Константы.СоздатьНабор("ВариантЗаполненияДатыОтгрузки,
		|ВидДнейРасчетаДатыОтгрузки, ПроизводственныйКалендарьРасчетаДатыОтгрузки, КоличествоДнейРасчетаДатыОтгрузки");
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("ВариантЗаполненияДатыОтгрузки", Перечисления.ВариантыЗаполненияДатыОтгрузки.Прибавлять);
	НастройкиПоУмолчанию.Вставить("ВидДнейРасчетаДатыОтгрузки", Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные);
	
	Календари = Справочники.ПроизводственныеКалендари.СписокПроизводственныхКалендарей();
	Если Календари.Количество() = 0 Тогда
		Календарь = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	Иначе
		Календарь = Календари[0];
	КонецЕсли;
	
	НастройкиПоУмолчанию.Вставить("ПроизводственныйКалендарьРасчетаДатыОтгрузки", Календарь);
	НастройкиПоУмолчанию.Вставить("КоличествоДнейРасчетаДатыОтгрузки", 0);
	
	ЗаполнитьЗначенияСвойств(НаборКонстант, НастройкиПоУмолчанию);
	НаборКонстант.Записать();
	
	// Дата оплаты по умолчанию будет равна дате документа
	НаборКонстант = Константы.СоздатьНабор("ВариантЗаполненияДатыОплаты,
		|ВидДнейРасчетаДатыОплаты, ПроизводственныйКалендарьРасчетаДатыОплаты, КоличествоДнейРасчетаДатыОплаты");
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("ВариантЗаполненияДатыОплаты", Перечисления.ВариантыЗаполненияДатыОтгрузки.Прибавлять);
	НастройкиПоУмолчанию.Вставить("ВидДнейРасчетаДатыОплаты", Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные);
	
	Календари = Справочники.ПроизводственныеКалендари.СписокПроизводственныхКалендарей();
	Если Календари.Количество() = 0 Тогда
		Календарь = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	Иначе
		Календарь = Календари[0];
	КонецЕсли;
	
	НастройкиПоУмолчанию.Вставить("ПроизводственныйКалендарьРасчетаДатыОплаты", Календарь);
	НастройкиПоУмолчанию.Вставить("КоличествоДнейРасчетаДатыОплаты", 0);
	
	ЗаполнитьЗначенияСвойств(НаборКонстант, НастройкиПоУмолчанию);
	НаборКонстант.Записать();
	
	// Выводим сумму без скидки в ПФ
	Константы.ВыводитьСуммуБезСкидки.Установить(Перечисления.ВариантыВыводаСуммыБезСкидки.Печатать);
	Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Артикул);
	Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаОрганизации.Установить(Истина);
	Константы.ФункциональнаяОпцияКонтрольДоговоров.Установить(Перечисления.ВидыКонтроляДоговоровПриПроведении.НеКонтролировать);
	
	РегистрыСведений.СчетчикиПодсказок.ОтключитьСчетчик(Перечисления.ВидыПодсказок.РеквизитыОрганизацииДляПечати, 
														10, , Справочники.Организации.ОсновнаяОрганизация);
	
КонецПроцедуры

Процедура ВосстановитьНастройкиФормыЗаказа(Форма)
	
	ИмяКлючаОбъекта = ПолучитьКлючОбъектаЗаказ();
	
	ЭтоНовыйОбъект = Форма.Объект.Ссылка.Пустая();
	ЭтоКопирование = ЗначениеЗаполнено(Форма.Параметры.ЗначениеКопирования);
	
	Если ЭтоНовыйОбъект И НЕ ЭтоКопирование Тогда
		
		СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_НДСУпрощенно");
		Если ЗначениеЗаполнено(СохраненноеЗначение) Тогда
			Форма.НДСУпрощенно = СохраненноеЗначение;
		КонецЕсли;
		
		СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ИспользоватьСкидки");
		Если СохраненноеЗначение  <> Неопределено Тогда
			Форма.Объект.ИспользоватьСкидкиВыставлениеСчетов = СохраненноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
	СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяКлючаОбъекта, ИмяКлючаОбъекта+"_ПраваяПанельСвернута");
	Если СохраненноеЗначение <> Неопределено Тогда
		Форма.ПраваяПанельСвернута = СохраненноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКлючОбъектаЗаказ()
	
	Возврат "ЗаказПокупателяВыставлениеСчетов"; // Не локализуется
	
КонецФункции

#КонецОбласти
